SecurityEvent
| where Computer contains "id.sdsu.edu"
| where EventID == 4768
| where TargetUserName !contains "$"
| where IpAddress matches regex "146.244.117.98"
or IpAddress matches regex "146.244.246.29"
or IpAddress matches regex "146.244.246.33"
or IpAddress matches regex "146.244.246.7[4-6]"
or IpAddress matches regex "146.244.246.80"
or IpAddress matches regex "146.244.246.91"
or IpAddress matches regex "146.244.246.9[3-5]"
or IpAddress matches regex "146.244.246.9[7-9]"
or IpAddress matches regex "146.244.246.10[0-4]"
or IpAddress matches regex "146.244.246.10[6-7]"
or IpAddress matches regex "146.244.246.1(0|1)(9|0)"
or IpAddress matches regex "146.244.246.11[2-9]"
or IpAddress matches regex "146.244.246.12[0-6]"
or IpAddress matches regex "146.244.246.130"
or IpAddress matches regex "146.244.246.132"
or IpAddress matches regex "146.244.246.13[4-7]"
or IpAddress matches regex "146.244.246.153"
or IpAddress matches regex "146.244.246.15[6-7]"
or IpAddress matches regex "146.244.246.16[0-6]"
or IpAddress matches regex "146.244.246.168"
or IpAddress matches regex "146.244.246.175"
or IpAddress matches regex "146.244.246.17[8-9]"
or IpAddress matches regex "146.244.246.181"
or IpAddress matches regex "146.244.246.186"
or IpAddress matches regex "146.244.246.190"
or IpAddress matches regex "146.244.246.194"
or IpAddress matches regex "146.244.246.208"
or IpAddress matches regex "146.244.246.212"
or IpAddress matches regex "146.244.246.23[1-2]"
| extend PacificTimeStamp = TimeGenerated  -7h
| project PacificTimeStamp, Account_Name = TargetUserName, Client_Address = IpAddress