let timeRange = 30d;
SigninLogs
| where TimeGenerated >= ago(timeRange)
| where ResultType == "50057"
| where ResultDescription == "User account is disabled. The account has been disabled by an administrator."
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), numberAccountsTargeted = dcount(UserPrincipalName),  numberApplicationsTargeted = dcount(AppDisplayName), accountSet = makeset(UserPrincipalName), applicationSet=makeset(AppDisplayName),  numberLoginAttempts = count() by IPAddress
| extend timestamp = StartTimeUtc, IPCustomEntity = IPAddress
| order by numberLoginAttempts desc