SecurityEvent
| where Computer contains "id.sdsu.edu"
| where NewUacValue != "0x10" and NewUacValue != "0x15" and NewUacValue != "0x11" and NewUacValue contains "0x1"
| extend PacificTimeStamp = TimeGenerated  -7h
| project PacificTimeStamp, EventID, TargetUserName, SubjectUserName, NewUacValue, OldUacValue