SecurityEvent | where Computer contains "id.sdsu.edu" | where EventID == 4624 or EventID == 4625 | where TimeGenerated  > datetime(2020-04-19T00:00:00Z) | where TimeGenerated  < datetime(2020-04-25T23:59:59Z) | where TargetUserName !contains "$" | where IpAddress contains "146.244.101.130" | extend PacificTimeStamp = TimeGenerated  -7h | project PacificTimeStamp, Account_Name = TargetUserName, Source_Network_Address = IpAddress