CommonSecurityLog
| where TimeGenerated > now() - 1d
| where DeviceVendor contains "Duo Security"
| where DeviceCustomString1 == "SDSU LastPass Enterprise"
| summarize count() by AdditionalExtensions, bin(TimeGenerated,1h)
| render timechart