CommonSecurityLog
| where TimeGenerated > now() - 1d
| where DeviceVendor contains "Duo Security"
| where DeviceCustomString1 == "SDSU Prod - Microsoft Azure Active Directory"
| summarize count() by AdditionalExtensions, bin(TimeGenerated,1h)
| render timechart