CommonSecurityLog
| where TimeGenerated > now() - 30d
| where DeviceVendor contains "Duo Security"
| where DeviceCustomString1 == "PAN GP VPN"
| summarize count() by AdditionalExtensions, bin(TimeGenerated,1d)
| render timechart