CommonSecurityLog
| where TimeGenerated > now() - 30d
| where DeviceVendor contains "Duo Security"
| where AdditionalExtensions == "outcome=success"
| summarize count() by DeviceCustomString1,AdditionalExtensions,bin(TimeGenerated,1d)
| render timechart